HasModifiedGeometry Method
 Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public bool HasModifiedGeometry()
  Visual Basic
Public Function HasModifiedGeometry As Boolean
  Visual C++
public:
bool HasModifiedGeometry()
 Remarks
 This method returns true if the geometry has been modified from post-processing activity in Revit such as joining, cutting, coping, extension, adaptive component modification, or other similar activity.
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →